Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.storage.resetAll
source: Clear All Local Data
ar: مسح جميع البيانات المحلية
de: Alle lokalen Daten löschen
es: Borrar todos los datos locales
fr: Effacer toutes les données locales
id: Hapus Semua Data Lokal
it: Cancella tutti i dati locali
ja: すべてのローカルデータを消去
ko: 모든 로컬 데이터 지우기
nl: Alle lokale gegevens wissen
pl: Wyczyść wszystkie dane lokalne
pt_br: Limpar Todos os Dados Locais
ru: Очистить все локальные данные
tr: Tüm Yerel Verileri Temizle
uk: Очистити всі локальні дані
vi: Xóa Tất cả Dữ liệu Cục bộ
zh_hans: 清空所有本地数据
zh_hant: 清空所有本地資料

# settings.storage.resetAll.completed.detail
source: Starcat has signed out locally and removed the selected user's local database, caches, generated files, settings, and local credentials. Restart Starcat, or quit and reopen it manually, then sign in again.
ar: قام Starcat بتسجيل الخروج محليًا وأزال قاعدة البيانات المحلية للمستخدم المحدد، والذاكرة المؤقتة، والملفات المنشأة، والإعدادات، وبيانات الاعتماد المحلية. أعد تشغيل Starcat، أو أغلقه وافتحه يدويًا، ثم سجل الدخول مرة أخرى.
de: Starcat hat sich lokal abgemeldet und die lokale Datenbank, Caches, generierte Dateien, Einstellungen und lokale Anmeldedaten des ausgewählten Benutzers entfernt. Starten Sie Starcat neu oder beenden und öffnen Sie es manuell erneut, und melden Sie sich dann wieder an.
es: Starcat ha cerrado sesión localmente y ha eliminado la base de datos local, cachés, archivos generados, ajustes y credenciales locales del usuario seleccionado. Reinicia Starcat, o ciérralo y ábrelo manualmente, luego inicia sesión de nuevo.
fr: Starcat s'est déconnecté localement et a supprimé la base de données locale, les caches, les fichiers générés, les réglages et les identifiants locaux de l'utilisateur sélectionné. Redémarrez Starcat, ou quittez-le et rouvrez-le manuellement, puis reconnectez-vous.
id: Starcat telah keluar secara lokal dan menghapus database lokal, cache, file yang dihasilkan, pengaturan, dan kredensial lokal pengguna yang dipilih. Mulai ulang Starcat, atau keluar dan buka kembali secara manual, lalu masuk lagi.
it: Starcat ha effettuato il logout locale e rimosso il database locale, le cache, i file generati, le impostazioni e le credenziali locali dell'utente selezionato. Riavvia Starcat, oppure esci e riaprilo manualmente, quindi accedi di nuovo.
ja: Starcatはローカルでサインアウトし、選択したユーザーのローカルデータベース、キャッシュ、生成ファイル、設定、ローカル認証情報を削除しました。Starcatを再起動するか、終了して手動で再度開き、サインインし直してください。
ko: Starcat이 로컬에서 로그아웃하고 선택한 사용자의 로컬 데이터베이스, 캐시, 생성된 파일, 설정 및 로컬 자격 증명을 제거했습니다. Starcat을 다시 시작하거나 종료 후 다시 열고 로그인하세요.
nl: Starcat is lokaal afgemeld en heeft de lokale database, caches, gegenereerde bestanden, instellingen en lokale inloggegevens van de geselecteerde gebruiker verwijderd. Start Starcat opnieuw op of sluit het af en open het handmatig opnieuw, en meld je vervolgens opnieuw aan.
pl: Starcat wylogował się lokalnie i usunął lokalną bazę danych, pamięci podręczne, wygenerowane pliki, ustawienia i poświadczenia wybranego użytkownika. Uruchom ponownie Starcat lub zamknij i otwórz go ręcznie, a następnie zaloguj się ponownie.
pt_br: O Starcat fez logout localmente e removeu o banco de dados local, caches, arquivos gerados, configurações e credenciais locais do usuário selecionado. Reinicie o Starcat, ou saia e reabra-o manualmente, e faça login novamente.
ru: Starcat выполнил локальный выход и удалил локальную базу данных, кеши, сгенерированные файлы, настройки и учётные данные выбранного пользователя. Перезапустите Starcat или закройте и откройте его вручную, затем войдите снова.
tr: Starcat yerel olarak oturumu kapattı ve seçilen kullanıcının yerel veritabanını, önbelleklerini, oluşturulan dosyalarını, ayarlarını ve yerel kimlik bilgilerini kaldırdı. Starcat'ı yeniden başlatın veya manuel olarak kapatıp tekrar açın, ardından yeniden oturum açın.
uk: Starcat вийшов із системи локально та видалив локальну базу даних, кеші, згенеровані файли, налаштування та локальні облікові дані вибраного користувача. Перезапустіть Starcat або закрийте та відкрийте його вручну, потім увійдіть знову.
vi: Starcat đã đăng xuất cục bộ và xóa cơ sở dữ liệu cục bộ, bộ nhớ đệm, tệp đã tạo, cài đặt và thông tin xác thực cục bộ của người dùng đã chọn. Khởi động lại Starcat, hoặc thoát và mở lại thủ công, sau đó đăng nhập lại.
zh_hans: Starcat 已在本机退出登录，并移除当前用户的本地数据库、缓存、生成文件、设置和本机凭据。你可以重启 Starcat，或退出后手动重新打开应用，然后重新登录。
zh_hant: Starcat 已在本機登出，並移除所選使用者的本地資料庫、快取、產生的檔案、設定和本機憑證。請重新啟動 Starcat，或手動結束並重新開啟，然後重新登入。

# settings.storage.resetAll.completed.message
source: Restart Starcat and sign in again to rebuild local data.
ar: أعد تشغيل Starcat وسجل الدخول مرة أخرى لإعادة بناء البيانات المحلية.
de: Starten Sie Starcat neu und melden Sie sich erneut an, um die lokalen Daten neu aufzubauen.
es: Reinicia Starcat e inicia sesión de nuevo para reconstruir los datos locales.
fr: Redémarrez Starcat et reconnectez-vous pour reconstruire les données locales.
id: Mulai ulang Starcat dan masuk lagi untuk membangun ulang data lokal.
it: Riavvia Starcat e accedi di nuovo per ricostruire i dati locali.
ja: Starcatを再起動してサインインし直すと、ローカルデータが再構築されます。
ko: Starcat을 다시 시작하고 로그인하여 로컬 데이터를 다시 빌드하세요.
nl: Start Starcat opnieuw op en meld je opnieuw aan om lokale gegevens opnieuw op te bouwen.
pl: Uruchom ponownie Starcat i zaloguj się ponownie, aby odbudować dane lokalne.
pt_br: Reinicie o Starcat e faça login novamente para reconstruir os dados locais.
ru: Перезапустите Starcat и войдите снова, чтобы восстановить локальные данные.
tr: Yerel verileri yeniden oluşturmak için Starcat'ı yeniden başlatın ve tekrar oturum açın.
uk: Перезапустіть Starcat і увійдіть знову, щоб відновити локальні дані.
vi: Khởi động lại Starcat và đăng nhập lại để xây dựng lại dữ liệu cục bộ.
zh_hans: 重启 Starcat 并重新登录后会重新构建本地数据。
zh_hant: 重新啟動 Starcat 並重新登入以重建本地資料。

# settings.storage.resetAll.completed.title
source: Local Data Cleared
ar: تم مسح البيانات المحلية
de: Lokale Daten gelöscht
es: Datos locales borrados
fr: Données locales effacées
id: Data Lokal Dihapus
it: Dati locali cancellati
ja: ローカルデータを消去しました
ko: 로컬 데이터 지워짐
nl: Lokale gegevens gewist
pl: Dane lokalne wyczyszczone
pt_br: Dados Locais Limpos
ru: Локальные данные очищены
tr: Yerel Veriler Temizlendi
uk: Локальні дані очищено
vi: Đã xóa Dữ liệu Cục bộ
zh_hans: 本地数据已清空
zh_hant: 本地資料已清空

# settings.storage.resetAll.confirm
source: Clear All Local Data
ar: مسح جميع البيانات المحلية
de: Alle lokalen Daten löschen
es: Borrar todos los datos locales
fr: Effacer toutes les données locales
id: Hapus Semua Data Lokal
it: Cancella tutti i dati locali
ja: すべてのローカルデータを消去
ko: 모든 로컬 데이터 지우기
nl: Alle lokale gegevens wissen
pl: Wyczyść wszystkie dane lokalne
pt_br: Limpar Todos os Dados Locais
ru: Очистить все локальные данные
tr: Tüm Yerel Verileri Temizle
uk: Очистити всі локальні дані
vi: Xóa Tất cả Dữ liệu Cục bộ
zh_hans: 清空所有本地数据
zh_hant: 清空所有本地資料

# settings.storage.resetAll.description
source: Factory reset local Starcat data for the signed-in account. Use this only when local data corruption causes app issues.
ar: إعادة تعيين بيانات Starcat المحلية لحساب المستخدم المسجل دخوله إلى إعدادات المصنع. استخدم هذا فقط عندما يتسبب تلف البيانات المحلية في مشاكل بالتطبيق.
de: Setzt die lokalen Starcat-Daten für das angemeldete Konto auf die Werkseinstellungen zurück. Verwenden Sie dies nur, wenn eine Beschädigung lokaler Daten zu App-Problemen führt.
es: Restablece de fábrica los datos locales de Starcat para la cuenta con sesión iniciada. Úsalo solo cuando la corrupción de datos locales cause problemas en la app.
fr: Réinitialisation d'usine des données locales de Starcat pour le compte connecté. Utilisez cette option uniquement en cas de corruption des données locales causant des problèmes dans l'application.
id: Reset pabrik data lokal Starcat untuk akun yang masuk. Gunakan ini hanya jika kerusakan data lokal menyebabkan masalah aplikasi.
it: Ripristina i dati locali di Starcat alle impostazioni di fabbrica per l'account connesso. Usalo solo quando la corruzione dei dati locali causa problemi all'app.
ja: サインインしているアカウントのStarcatローカルデータを工場出荷時状態にリセットします。ローカルデータの破損がアプリの問題を引き起こす場合にのみ使用してください。
ko: 로그인된 계정의 Starcat 로컬 데이터를 공장 초기화합니다. 로컬 데이터 손상으로 앱 문제가 발생할 때만 사용하세요.
nl: Fabrieksreset van lokale Starcat-gegevens voor het aangemelde account. Gebruik dit alleen wanneer lokale gegevenscorruptie app-problemen veroorzaakt.
pl: Przywróć ustawienia fabryczne lokalnych danych Starcat dla zalogowanego konta. Użyj tylko wtedy, gdy uszkodzenie danych lokalnych powoduje problemy z aplikacją.
pt_br: Redefinição de fábrica dos dados locais do Starcat para a conta logada. Use apenas quando a corrupção de dados locais causar problemas no aplicativo.
ru: Сброс локальных данных Starcat для текущей учётной записи до заводских настроек. Используйте только при повреждении локальных данных, вызывающем проблемы в приложении.
tr: Oturum açılmış hesap için Starcat yerel verilerini fabrika ayarlarına sıfırlayın. Bunu yalnızca yerel veri bozulması uygulama sorunlarına neden olduğunda kullanın.
uk: Скинути локальні дані Starcat до заводських налаштувань для ввійденого облікового запису. Використовуйте це лише тоді, коли пошкодження локальних даних спричиняє проблеми з додатком.
vi: Khôi phục cài đặt gốc dữ liệu Starcat cục bộ cho tài khoản đã đăng nhập. Chỉ sử dụng khi dữ liệu cục bộ bị hỏng gây ra sự cố ứng dụng.
zh_hans: 将当前登录账号的 Starcat 本机数据恢复到首次安装状态。仅建议在本地数据异常导致应用问题时使用。
zh_hant: 將目前登入帳號的 Starcat 本地資料重設為出廠狀態。僅在本地資料損壞導致應用程式問題時使用。

# settings.storage.resetAll.error.notAuthenticated
source: Sign in before clearing local app data.
ar: سجل الدخول قبل مسح بيانات التطبيق المحلية.
de: Melden Sie sich an, bevor Sie lokale App-Daten löschen.
es: Inicia sesión antes de borrar los datos locales de la app.
fr: Connectez-vous avant d'effacer les données locales de l'application.
id: Masuk sebelum menghapus data aplikasi lokal.
it: Accedi prima di cancellare i dati locali dell'app.
ja: ローカルアプリデータを消去する前にサインインしてください。
ko: 로컬 앱 데이터를 지우기 전에 로그인하세요.
nl: Meld je aan voordat je lokale app-gegevens wist.
pl: Zaloguj się przed wyczyszczeniem lokalnych danych aplikacji.
pt_br: Faça login antes de limpar os dados locais do aplicativo.
ru: Войдите в систему перед очисткой локальных данных приложения.
tr: Yerel uygulama verilerini temizlemeden önce oturum açın.
uk: Увійдіть перед очищенням локальних даних додатка.
vi: Đăng nhập trước khi xóa dữ liệu ứng dụng cục bộ.
zh_hans: 请先登录，再清空本机应用数据。
zh_hant: 請先登入，再清空本地應用程式資料。

# settings.storage.resetAll.quit
source: Quit Starcat
ar: إنهاء Starcat
de: Starcat beenden
es: Salir de Starcat
fr: Quitter Starcat
id: Keluar dari Starcat
it: Esci da Starcat
ja: Starcatを終了
ko: Starcat 종료
nl: Starcat afsluiten
pl: Zamknij Starcat
pt_br: Sair do Starcat
ru: Закрыть Starcat
tr: Starcat'tan Çık
uk: Завершити Starcat
vi: Thoát Starcat
zh_hans: 退出 Starcat
zh_hant: 結束 Starcat

# settings.storage.resetAll.resetting
source: Clearing local data...
ar: جارٍ مسح البيانات المحلية...
de: Lokale Daten werden gelöscht...
es: Borrando datos locales...
fr: Effacement des données locales...
id: Menghapus data lokal...
it: Cancellazione dati locali in corso...
ja: ローカルデータを消去中...
ko: 로컬 데이터 지우는 중...
nl: Lokale gegevens wissen...
pl: Czyszczenie danych lokalnych...
pt_br: Limpando dados locais...
ru: Очистка локальных данных...
tr: Yerel veriler temizleniyor...
uk: Очищення локальних даних...
vi: Đang xóa dữ liệu cục bộ...
zh_hans: 正在清空本地数据...
zh_hant: 正在清空本地資料…

# settings.storage.resetAll.restart
source: Restart Starcat
ar: إعادة تشغيل Starcat
de: Starcat neu starten
es: Reiniciar Starcat
fr: Redémarrer Starcat
id: Mulai Ulang Starcat
it: Riavvia Starcat
ja: Starcatを再起動
ko: Starcat 다시 시작
nl: Starcat opnieuw opstarten
pl: Uruchom ponownie Starcat
pt_br: Reiniciar Starcat
ru: Перезапустить Starcat
tr: Starcat'ı Yeniden Başlat
uk: Перезапустити Starcat
vi: Khởi động lại Starcat
zh_hans: 重启 Starcat
zh_hant: 重新啟動 Starcat

# settings.storage.resetAll.scope.caches
source: Local README, image, ZIP, translation, search, wiki probe, and chat history caches.
ar: ذاكرة README المحلية المؤقتة، الصور، ZIP، الترجمة، البحث، فحص الويكي، وسجل المحادثات.
de: Lokale README-, Bild-, ZIP-, Übersetzungs-, Such-, Wiki-Probe- und Chatverlauf-Caches.
es: Cachés locales de README, imágenes, ZIP, traducciones, búsqueda, sonda wiki e historial de chat.
fr: Caches locaux : README, images, ZIP, traductions, recherche, sondage Wiki et historique de chat.
id: Cache lokal README, gambar, ZIP, terjemahan, pencarian, probe wiki, dan riwayat chat.
it: Cache locali di README, immagini, ZIP, traduzioni, ricerca, sondaggi wiki e cronologia chat.
ja: ローカルのREADME、画像、ZIP、翻訳、検索、Wikiプローブ、チャット履歴のキャッシュ。
ko: 로컬 README, 이미지, ZIP, 번역, 검색, wiki 프로브 및 채팅 기록 캐시.
nl: Lokale README-, afbeelding-, ZIP-, vertaal-, zoek-, wiki-probe- en gespreksgeschiedeniscaches.
pl: Lokalne pamięci podręczne: README, obrazów, ZIP, tłumaczeń, wyszukiwania, sondowania Wiki i historii czatu.
pt_br: Caches locais de README, imagens, ZIP, tradução, pesquisa, sondagem wiki e histórico de chat.
ru: Локальные кеши README, изображений, ZIP, переводов, поиска, Wiki-зондов и истории чатов.
tr: Yerel README, görsel, ZIP, çeviri, arama, wiki yoklama ve sohbet geçmişi önbellekleri.
uk: Локальні кеші README, зображень, ZIP, перекладів, пошуку, Wiki-зондування та історії чату.
vi: Bộ nhớ đệm README, hình ảnh, ZIP, bản dịch, tìm kiếm, thăm dò wiki và lịch sử chat cục bộ.
zh_hans: 本机 README、图片、ZIP、翻译、搜索、Wiki 探测和对话历史缓存。
zh_hant: 本地 README、圖片、ZIP、翻譯、搜尋、Wiki 探測和聊天記錄快取。

# settings.storage.resetAll.scope.credentials
source: Local encrypted credentials, including GitHub token, AI API keys, and service API keys.
ar: بيانات الاعتماد المحلية المشفرة، بما في ذلك رمز GitHub، مفاتيح واجهة برمجة تطبيقات الذكاء الاصطناعي، ومفاتيح واجهة برمجة تطبيقات الخدمات.
de: Lokale verschlüsselte Anmeldedaten, einschließlich GitHub-Token, KI-API-Schlüssel und Dienst-API-Schlüssel.
es: Credenciales cifradas locales, incluido el token de GitHub, claves de API de IA y claves de API de servicio.
fr: Identifiants locaux chiffrés, y compris le jeton GitHub, les clés API IA et les clés API de service.
id: Kredensial terenkripsi lokal, termasuk token GitHub, kunci API AI, dan kunci API layanan.
it: Credenziali locali crittografate, inclusi token GitHub, chiavi API AI e chiavi API di servizio.
ja: ローカルの暗号化された認証情報（GitHubトークン、AI APIキー、サービスAPIキーを含む）。
ko: GitHub 토큰, AI API 키 및 서비스 API 키를 포함한 로컬 암호화된 자격 증명.
nl: Lokale versleutelde inloggegevens, waaronder GitHub-token, AI-API-sleutels en service-API-sleutels.
pl: Lokalne zaszyfrowane poświadczenia, w tym token GitHub, klucze API AI i klucze API usług.
pt_br: Credenciais locais criptografadas, incluindo token do GitHub, chaves de API de IA e chaves de API de serviços.
ru: Локальные зашифрованные учётные данные, включая токен GitHub, ключи API ИИ и ключи API сервисов.
tr: GitHub token'ı, AI API anahtarları ve servis API anahtarları dahil yerel şifrelenmiş kimlik bilgileri.
uk: Локальні зашифровані облікові дані, включаючи токен GitHub, ключі API ШІ та ключі API сервісів.
vi: Thông tin xác thực được mã hóa cục bộ, bao gồm token GitHub, khóa API AI và khóa API dịch vụ.
zh_hans: 本机加密凭据，包括 GitHub token、AI API Key 和服务 API Key。
zh_hant: 本地加密憑證，包括 GitHub token、AI API 金鑰和服務 API 金鑰。

# settings.storage.resetAll.scope.database
source: The signed-in user's local SQLite database: repo cache, local notes, tags, status, and derived data.
ar: قاعدة بيانات SQLite المحلية للمستخدم المسجل دخوله: ذاكرة المستودع المؤقتة، الملاحظات المحلية، العلامات، الحالة، والبيانات المشتقة.
de: Lokale SQLite-Datenbank des angemeldeten Benutzers: Repo-Cache, lokale Notizen, Tags, Status und abgeleitete Daten.
es: Base de datos SQLite local del usuario con sesión iniciada: caché de repositorios, notas locales, etiquetas, estado y datos derivados.
fr: Base de données SQLite locale de l'utilisateur connecté : cache de dépôts, notes locales, tags, statut et données dérivées.
id: Database SQLite lokal pengguna yang masuk: cache repo, catatan lokal, tag, status, dan data turunan.
it: Database SQLite locale dell'utente connesso: cache dei repository, note locali, tag, stato e dati derivati.
ja: サインインしているユーザーのローカルSQLiteデータベース：リポジトリキャッシュ、ローカルノート、タグ、ステータス、派生データ。
ko: 로그인한 사용자의 로컬 SQLite 데이터베이스: 저장소 캐시, 로컬 노트, 태그, 상태 및 파생 데이터.
nl: De lokale SQLite-database van de aangemelde gebruiker: repo-cache, lokale notities, tags, status en afgeleide gegevens.
pl: Lokalna baza danych SQLite zalogowanego użytkownika: pamięć podręczna repozytoriów, lokalne notatki, tagi, status i dane pochodne.
pt_br: O banco de dados SQLite local do usuário logado: cache de repositórios, notas locais, tags, status e dados derivados.
ru: Локальная база данных SQLite текущего пользователя: кеш репозиториев, локальные заметки, теги, статусы и производные данные.
tr: Oturum açmış kullanıcının yerel SQLite veritabanı: depo önbelleği, yerel notlar, etiketler, durum ve türetilmiş veriler.
uk: Локальна база даних SQLite ввійденого користувача: кеш репозиторіїв, локальні нотатки, теги, статус та похідні дані.
vi: Cơ sở dữ liệu SQLite cục bộ của người dùng đã đăng nhập: bộ nhớ đệm kho lưu trữ, ghi chú cục bộ, thẻ, trạng thái và dữ liệu phái sinh.
zh_hans: 当前登录用户的本地 SQLite 数据库：仓库缓存、本地笔记、标签、状态和派生数据。
zh_hant: 目前登入使用者的本地 SQLite 資料庫：倉庫快取、本地筆記、標籤、狀態和衍生資料。

# settings.storage.resetAll.scope.generated
source: Generated Code Context and CodeFlow files stored by Starcat.
ar: ملفات سياق الشيفرة و CodeFlow المنشأة المخزنة بواسطة Starcat.
de: Von Starcat gespeicherte generierte Code Context- und CodeFlow-Dateien.
es: Archivos generados de Code Context y CodeFlow almacenados por Starcat.
fr: Fichiers de contexte de code et CodeFlow générés stockés par Starcat.
id: File Code Context dan CodeFlow yang dihasilkan yang disimpan oleh Starcat.
it: File generati di Code Context e CodeFlow memorizzati da Starcat.
ja: Starcatが保存した生成済みのCode ContextおよびCodeFlowファイル。
ko: Starcat이 저장한 생성된 Code Context 및 CodeFlow 파일.
nl: Gegenereerde Code Context- en CodeFlow-bestanden opgeslagen door Starcat.
pl: Wygenerowane pliki Code Context i CodeFlow przechowywane przez Starcat.
pt_br: Arquivos gerados de Code Context e CodeFlow armazenados pelo Starcat.
ru: Сгенерированные файлы Code Context и CodeFlow, сохранённые Starcat.
tr: Starcat tarafından saklanan oluşturulmuş Kod Bağlamı ve CodeFlow dosyaları.
uk: Згенеровані файли Code Context та CodeFlow, що зберігаються Starcat.
vi: Tệp Ngữ cảnh Mã và CodeFlow đã tạo do Starcat lưu trữ.
zh_hans: Starcat 生成的 Code Context 与 CodeFlow 文件。
zh_hant: Starcat 儲存的 Code Context 與 CodeFlow 檔案。

# settings.storage.resetAll.scope.remoteSafe
source: Remote GitHub stars, CloudKit data, backend service data, and payment or license records are not modified.
ar: لا يتم تعديل نجوم GitHub عن بُعد، بيانات CloudKit، بيانات الخدمة الخلفية، وسجلات الدفع أو الترخيص.
de: Remote-GitHub-Sterne, CloudKit-Daten, Backend-Dienst-Daten sowie Zahlungs- oder Lizenzaufzeichnungen werden nicht geändert.
es: Las estrellas remotas de GitHub, los datos de CloudKit, los datos del servicio backend y los registros de pago o licencia no se modifican.
fr: Les étoiles GitHub distantes, les données CloudKit, les données du service backend et les enregistrements de paiement ou de licence ne sont pas modifiés.
id: Bintang GitHub jarak jauh, data CloudKit, data layanan backend, dan catatan pembayaran atau lisensi tidak dimodifikasi.
it: Le stelle GitHub remote, i dati CloudKit, i dati del servizio backend e i record di pagamento o licenza non vengono modificati.
ja: リモートのGitHubスター、CloudKitデータ、バックエンドサービスのデータ、支払い・ライセンス記録は変更されません。
ko: 원격 GitHub 별표, CloudKit 데이터, 백엔드 서비스 데이터 및 결제/라이선스 기록은 수정되지 않습니다.
nl: Externe GitHub-sterren, CloudKit-gegevens, backend-servicegegevens en betalings- of licentierecords worden niet gewijzigd.
pl: Zdalne gwiazdki GitHub, dane CloudKit, dane usług backendowych oraz rekordy płatności i licencji nie są modyfikowane.
pt_br: Estrelas remotas do GitHub, dados do CloudKit, dados de serviços de backend e registros de pagamento ou licença não são modificados.
ru: Удалённые звёзды GitHub, данные CloudKit, данные серверных служб, а также записи об оплате и лицензиях не изменяются.
tr: Uzaktaki GitHub yıldızları, CloudKit verileri, arka uç servis verileri ile ödeme veya lisans kayıtları değiştirilmez.
uk: Віддалені зірки GitHub, дані CloudKit, дані серверної служби та записи про оплату або ліцензії не змінюються.
vi: Các ngôi sao GitHub từ xa, dữ liệu CloudKit, dữ liệu dịch vụ phụ trợ và hồ sơ thanh toán hoặc giấy phép không bị sửa đổi.
zh_hans: 不会修改远端 GitHub stars、CloudKit 数据、后端服务数据或支付 / 授权记录。
zh_hant: 不會修改遠端 GitHub stars、CloudKit 資料、後端服務資料或付款/授權記錄。

# settings.storage.resetAll.scope.settings
source: Local settings such as general preferences, AI providers, service URLs, MCP, shortcuts, and notification toggles.
ar: الإعدادات المحلية مثل التفضيلات العامة، مزودي الذكاء الاصطناعي، عناوين URL للخدمات، MCP، الاختصارات، ومفاتيح تبديل الإشعارات.
de: Lokale Einstellungen wie allgemeine Präferenzen, KI-Anbieter, Dienst-URLs, MCP, Tastenkombinationen und Benachrichtigungsschalter.
es: Ajustes locales como preferencias generales, proveedores de IA, URL de servicio, MCP, atajos y conmutadores de notificaciones.
fr: Réglages locaux tels que les préférences générales, les fournisseurs IA, les URL de service, MCP, les raccourcis et les bascules de notification.
id: Pengaturan lokal seperti preferensi umum, penyedia AI, URL layanan, MCP, pintasan, dan sakelar notifikasi.
it: Impostazioni locali come preferenze generali, provider AI, URL di servizio, MCP, scorciatoie e interruttori di notifica.
ja: 一般設定、AIプロバイダー、サービスURL、MCP、ショートカット、通知の切り替えなどのローカル設定。
ko: 일반 환경설정, AI 제공자, 서비스 URL, MCP, 단축키 및 알림 토글과 같은 로컬 설정.
nl: Lokale instellingen zoals algemene voorkeuren, AI-providers, service-URL's, MCP, snelkoppelingen en meldingsschakelaars.
pl: Lokalne ustawienia, takie jak ogólne preferencje, dostawcy AI, adresy URL usług, MCP, skróty klawiszowe i przełączniki powiadomień.
pt_br: Configurações locais, como preferências gerais, provedores de IA, URLs de serviço, MCP, atalhos e opções de notificação.
ru: Локальные настройки, такие как общие предпочтения, поставщики ИИ, URL сервисов, MCP, сочетания клавиш и переключатели уведомлений.
tr: Genel tercihler, AI sağlayıcıları, servis URL'leri, MCP, kısayollar ve bildirim anahtarları gibi yerel ayarlar.
uk: Локальні налаштування, такі як загальні параметри, постачальники ШІ, URL-адреси служб, MCP, комбінації клавіш та перемикачі сповіщень.
vi: Cài đặt cục bộ như tùy chọn chung, nhà cung cấp AI, URL dịch vụ, MCP, phím tắt và công tắc thông báo.
zh_hans: 本机配置，包括通用偏好、AI 服务商、服务 URL、MCP、快捷键和通知开关。
zh_hant: 本地設定，包括一般偏好、AI 提供者、服務 URL、MCP、快捷鍵和通知開關。

# settings.storage.resetAll.scope.title
source: This will delete:
ar: سيؤدي هذا إلى حذف:
de: Dies wird gelöscht:
es: Esto eliminará:
fr: Cela va supprimer :
id: Ini akan menghapus:
it: Questo eliminerà:
ja: これにより削除されるもの：
ko: 다음이 삭제됩니다:
nl: Dit wordt verwijderd:
pl: Spowoduje to usunięcie:
pt_br: Isso irá excluir:
ru: Будет удалено:
tr: Bu şunları silecek:
uk: Буде видалено:
vi: Thao tác này sẽ xóa:
zh_hans: 将删除以下本机数据：
zh_hant: 將刪除以下項目：
